In [2]:
print("Hello world")

Hello world

In [3]:
import numpy as np
import pandas as pd

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range("20130101",periods=6)
dates

df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.642061  0.234506 -1.223280  0.571727
2013-01-02 -0.973716 -0.935277 -1.182149 -1.127462
2013-01-03  0.968657 -1.001604 -0.466792  0.142995
2013-01-04 -0.530150  0.535992  0.244682 -1.229778
2013-01-05  0.447013 -1.801059 -0.055890  0.057849
2013-01-06 -0.017570  0.633836 -0.479526 -0.369043

In [6]:
df2 = pd.DataFrame(
    {
        'A': 1.0,
        'B': pd.Timestamp("20130102"),
        'C': pd.Series(1, index=list(range(4)), dtype="float32"),
        'D': np.array([3] * 4, dtype="int32"),
        'E': pd.Categorical(["test", "train", "test", "train"]),
        'F': "foo",        
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -0.642061  0.234506 -1.223280  0.571727
2013-01-02 -0.973716 -0.935277 -1.182149 -1.127462
2013-01-03  0.968657 -1.001604 -0.466792  0.142995
2013-01-04 -0.530150  0.535992  0.244682 -1.229778
2013-01-05  0.447013 -1.801059 -0.055890  0.057849

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.530150  0.535992  0.244682 -1.229778
2013-01-05  0.447013 -1.801059 -0.055890  0.057849
2013-01-06 -0.017570  0.633836 -0.479526 -0.369043

In [10]:
df.index

df. columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.to_numpy()

array([[-0.64206077,  0.23450582, -1.22328019,  0.57172681],
       [-0.97371563, -0.93527699, -1.18214917, -1.12746197],
       [ 0.96865652, -1.00160385, -0.46679153,  0.14299547],
       [-0.53015019,  0.53599227,  0.24468226, -1.22977805],
       [ 0.44701292, -1.80105852, -0.05589039,  0.05784907],
       [-0.01757031,  0.63383593, -0.47952592, -0.36904271]])

In [12]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.124638 -0.388934 -0.527159 -0.325619
std    0.733027  0.995809  0.589465  0.725840
min   -0.973716 -1.801059 -1.223280 -1.229778
25%   -0.614083 -0.985022 -1.006493 -0.937857
50%   -0.273860 -0.350386 -0.473159 -0.155597
75%    0.330867  0.460621 -0.158616  0.121709
max    0.968657  0.633836  0.244682  0.571727

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.642061   -0.973716    0.968657   -0.530150    0.447013   -0.017570
B    0.234506   -0.935277   -1.001604    0.535992   -1.801059    0.633836
C   -1.223280   -1.182149   -0.466792    0.244682   -0.055890   -0.479526
D    0.571727   -1.127462    0.142995   -1.229778    0.057849   -0.369043

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.571727 -1.223280  0.234506 -0.642061
2013-01-02 -1.127462 -1.182149 -0.935277 -0.973716
2013-01-03  0.142995 -0.466792 -1.001604  0.968657
2013-01-04 -1.229778  0.244682  0.535992 -0.530150
2013-01-05  0.057849 -0.055890 -1.801059  0.447013
2013-01-06 -0.369043 -0.479526  0.633836 -0.017570

In [18]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05  0.447013 -1.801059 -0.055890  0.057849
2013-01-03  0.968657 -1.001604 -0.466792  0.142995
2013-01-02 -0.973716 -0.935277 -1.182149 -1.127462
2013-01-01 -0.642061  0.234506 -1.223280  0.571727
2013-01-04 -0.530150  0.535992  0.244682 -1.229778
2013-01-06 -0.017570  0.633836 -0.479526 -0.369043

In [21]:
df["A"]

2013-01-01   -0.642061
2013-01-02   -0.973716
2013-01-03    0.968657
2013-01-04   -0.530150
2013-01-05    0.447013
2013-01-06   -0.017570
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.642061  0.234506 -1.223280  0.571727
2013-01-02 -0.973716 -0.935277 -1.182149 -1.127462
2013-01-03  0.968657 -1.001604 -0.466792  0.142995

In [26]:
df.loc[dates[0]]

A   -0.642061
B    0.234506
C   -1.223280
D    0.571727
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.642061  0.234506
2013-01-02 -0.973716 -0.935277
2013-01-03  0.968657 -1.001604
2013-01-04 -0.530150  0.535992
2013-01-05  0.447013 -1.801059
2013-01-06 -0.017570  0.633836

In [28]:
df.loc["20130102":"20130104",["A","B"]]

                   A         B
2013-01-02 -0.973716 -0.935277
2013-01-03  0.968657 -1.001604
2013-01-04 -0.530150  0.535992

In [29]:
df.loc[dates[0],"A"]

-0.6420607706663412

In [30]:
df.at[dates[0],"A"]

-0.6420607706663412

In [31]:
df.iloc[3]

A   -0.530150
B    0.535992
C    0.244682
D   -1.229778
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.530150  0.535992
2013-01-05  0.447013 -1.801059

In [ ]:
df.iloc[[1, 2, 4],[0, 2]]

                   A         C
2013-01-02 -0.973716 -1.182149
2013-01-03  0.968657 -0.466792
2013-01-05  0.447013 -0.055890

In [34]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.973716 -0.935277 -1.182149 -1.127462
2013-01-03  0.968657 -1.001604 -0.466792  0.142995

In [35]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.234506 -1.223280
2013-01-02 -0.935277 -1.182149
2013-01-03 -1.001604 -0.466792
2013-01-04  0.535992  0.244682
2013-01-05 -1.801059 -0.055890
2013-01-06  0.633836 -0.479526

In [37]:
df.iloc[1,1]

-0.9352769857937678

In [38]:
df.iat[1,1]

-0.9352769857937678

In [39]:
df[df["A"]>0]

                   A         B         C         D
2013-01-03  0.968657 -1.001604 -0.466792  0.142995
2013-01-05  0.447013 -1.801059 -0.055890  0.057849

In [40]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.234506       NaN  0.571727
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  0.968657       NaN       NaN  0.142995
2013-01-04       NaN  0.535992  0.244682       NaN
2013-01-05  0.447013       NaN       NaN  0.057849
2013-01-06       NaN  0.633836       NaN       NaN

In [43]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.968657 -1.001604 -0.466792  0.142995   two
2013-01-05  0.447013 -1.801059 -0.055890  0.057849  four

In [45]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [46]:
df["F"] = s1

In [48]:
df.at[dates[0], "A"] = 0

In [49]:
df.iat[0, 1] = 0

In [50]:
df.loc[:, "D"] = np.array([5] * len(df))

In [51]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.223280  5.0  NaN
2013-01-02 -0.973716 -0.935277 -1.182149  5.0  1.0
2013-01-03  0.968657 -1.001604 -0.466792  5.0  2.0
2013-01-04 -0.530150  0.535992  0.244682  5.0  3.0
2013-01-05  0.447013 -1.801059 -0.055890  5.0  4.0
2013-01-06 -0.017570  0.633836 -0.479526  5.0  5.0